-- 表 table

--所有的复杂类型 都是table

print("****************数组*****************")
a = {1,2,3,4,5,6,7,8,9, nil}
-- lua中 索引从1开始
print(a[1])
print(a[45])

-- #号是通用的获取长度的关键字 遍历到nil 直接断掉 并且后边不算长度
-- nil 放到最后才不算长度
print(#a)

print("****************数组的遍历*****************")
a = {1,2, nil,3,4,5,6,7,8,9}
for i = 1,#a,1 do
	print(a[i])
end
print("****************二维数组*****************")
a = {{1,2,3}, {4,5,6}}
print(a[1][3])
print(a[2][3])
--print(a[3][3])  报错



print("****************二维数组的遍历*****************")
for i = 1, #a do
	b = a[i]
	for j=1,#b do
		print(b[j])
	end
end
print("****************自定义索引*****************")
aa = {[1] = 1,2,3, [1] = 4,5,6, [2] = 7, 8, 9}
print(#aa)
aa = {[0] = 1, 2, 3, [-1] = 4, 5}
print(aa[0])
print(aa[-1])